Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeIncompatError Property
 The selected fitting(s) cannot successfully change the type. The newly selected fabrication part type either has no material or has badly configured dimensions, resulting in bad geometry. You may try to disconnect the connections on the fitting(s) and try again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartCannotChangeTypeIncompatError { get; }
Public Shared ReadOnly Property FabricationPartCannotChangeTypeIncompatError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartCannotChangeTypeIncompatError {
	FailureDefinitionId^ get ();
}
static member FabricationPartCannotChangeTypeIncompatError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace